Repository: fanyer/presto
Catalog: data/translations/*/unite/*.po
Languages: nl

source: The sharing link is the Web address that gives access to a shared folder on your computer. When you share this Web address, visitors can download the files inside that folder.
nl: De 'delen'-link is het webadres dat toegang geeft tot een gedeelde map op uw computer. Wanneer u dit webadres deelt, kunnen bezoekers bestanden in deze map downloaden.

source: The sharing link is the Web address that gives access to a shared folder on your computer. When you share this Web address, visitors can see the photos inside that folder.
nl: De 'delen'-link is het webadres dat toegang geeft tot een gedeelde map op uw computer. Wanneer u dit webadres deelt, kunnen bezoekersde foto's in deze deze map bekijken.

source: The sharing link is the Web address that gives access to a shared folder on your computer. When you share this Web address, visitors can listen to the music inside that folder.
nl: De 'delen'-link is het webadres dat toegang geeft tot een gedeelde map op uw computer. Wanneer u dit webadres deelt, kunnen bezoekers luisteren naar de muziek in deze map.

source: The sharing link is the Web address that gives access to a shared folder on your computer. When you share this Web address, visitors can access the content inside that folder.
nl: De 'delen'-link is het webadres dat toegang geeft tot een gedeelde map op uw computer. Wanneer u dit webadres deelt, hebben bezoekers toegang tot de materialen in deze map.

source: Troubleshooting
nl: Probleemoplossing

source: Try reloading the page.
nl: Probeer de pagina te herladen.

source: {visitorname} is here.
nl: {visitorname} is hier.

source: A large file is being downloaded: {filenamesize}
nl: Een groot bestand wordt gedownload: {filenamesize}

source: {visitorName} has written in the Shoutbox
nl: {visitorName} heeft in de Shoutbox geschreven

source: {photo} was rotated.
nl: {photo} is gedraaid.

source: {filename} is popular.
nl: {filename} is populair.

source: {popSong} is popular.
nl: {popSong} is populair.

source: A visitor downloaded a playlist of {folderName}.
nl: Een bezoeker heeft een speellijst gedownload van {folderName}.

source: {photo} was viewed in original size.
nl: {photo} is bekeken op de original grootte.

source: Folder not found. To select a new one, right-click <STRONG>{serviceName}</STRONG> in the Unite panel, and select <STRONG>Properties</STRONG>
nl: Map niet gevonden. Rechtsklik op <STRONG>{serviceName}</STRONG> in het Unite-paneel, en kies <STRONG>Eigenschappen</STRONG> om een nieuwe te selecteren.

source: This application creates photo albums from the image files in the folder you select.
nl: Deze toepassing maakt foto-albums voor de afbeeldingen in de door u gekozen map.

source: Link for your Photo Sharing application:
nl: Link voor uw Photo Sharing-toepassing:

source: Photo Sharing usually uses this information to automatically rotate your photos.
nl: Photo Sharing gebruikt deze informatie meestal om uw foto's automatisch te draaien.

source: Use the rotation tool to change the displayed image in Photo Sharing. The original image will not be affected.
nl: Gebruikt het draaigereedschap om in Photo Sharing getoonde afbeeldingen te wijzigen. De originele afbeelding zal niet worden veranderd.

source: A photo is viewed in its original size
nl: Een foto is bekeken op de originele grootte

source: Right-click the file path.
nl: Rechtsklik op het bestandspad.

source: Select "Open folder".
nl: Kies "Map openen".

source: After editing your files, select the Reload button on the {serviceName} page to see your changes.
nl: Gebruik de knop Herladen op de {serviceName}-pagina na het bewerken van uw bestanden om uw wijzigingen te zien.

source: When you change the folder, {serviceName} no longer accesses the old folder, and shares content from the new folder.
nl: Wanneer u de map wijzigt, zal {serviceName} de oude map niet meer kunnen bereiken, en materiaal uit de nieuwe map delen.

source: After changing the folder, select the Reload button on the {serviceName} page to see your changes.
nl: Gebruik de knop Herladen op de {serviceName}-pagina na het wijzigen van de map om uw wijzigingen te zien.

source: Each {serviceName} application shares one main folder. If you want to share another, different folder, you need to install another instance of the {serviceName} application for that folder.
nl: Elke {serviceName}-toepassing deelt één hoofdmap. Als u ook een andere map wilt delen, moet u nog een exemplaar van de {serviceName}-toepassing installeren voor die map.

source: You can copy the link, and paste it into a chat message or e-mail, as you would normally send a link to someone.
nl: U kunt de link kopiëren en in een chatbericht of een e-mail plakken, net zoals u anders een link naar iemand stuurt.

source: Help using privacy options
nl: Help bij het gebruik van privacy-opties

source: What does "Public" mean?
nl: Wat betekent "Openbaar"?

source: Help using the single-click login
nl: Help bij het gebruik van de een-klik-login

source: The single-click login is a single link that visitors can use to access your application directly, without logging in. It combines the application Web address and a scrambled version of the password.
nl: De een-klik-login is een enkele link die door bezoekers kan worden gebruikt voor directe toegang tot uw toepassingen, zonder in te loggen. Het combineert het webadres van de toepassing met een verhaspelde versie van het wachtwoord.

source: Please be aware that anyone with this link can access your content, so caution your friends against forwarding the link to other people.
nl: Let er op dat iedereen via deze link toegang heeft tot uw materiaal. Dus waarschuw uw vrienden deze link niet door te sturen aan andere mensen.

source: If you change the password for {serviceName}, previous single-click login links will no longer work.
nl: Als u het wachtwoord voor {serviceName} wijzigt, zullen voorgaande een-klik-loginlinks niet meer werken.

source: In the Shoutbox, you can type quick messages to visitors of any of the applications you are running. Visitors can also leave messages for you.
nl: In de Shoutbox kunt uw snelle berichten schrijven voor bezoekers van de andere toepassingen die u draait. Bezoekers kunnen ook berichten achterlaten voor u.

source: One Shoutbox is shared between all your Opera Unite applications. For example, a message typed in Photo Sharing also appears in Media Player.
nl: De Shoutbox wordt gedeeld door al uw Opera Unite-toepassingen. Zo zal een bericht dat wordt getypt in Photo Sharing ook verschijnen in Media Player.

source: The Shoutbox is emptied when you stop Opera Unite or close Opera.
nl: De Shoutbox wordt geleegd wanneer u Opera Unite stopt of Opera afsluit.

source: If you are viewing another tab in the browser, a notification displays when you receive a message from a visitor. <A class="helpShowMe" href="{linkShowMe}">show me an example</A>
nl: Als u een andere tab bekijkt in de browser, zal er een melding verschijnen wanneer u een bericht van een bezoeker ontvangt. <A class="helpShowMe" href="{linkShowMe}">voorbeeld laten zien</A>

source: Notifications display as small messages on your screen when something important happens. <A class="helpShowMe" href="{linkShowMe}">show me an example</A>
nl: Meldingen verschijnen als kleine berichten op uw scherm wanneer er iets belangrijks gebeurt. <A class="helpShowMe" href="{linkShowMe}">voorbeeld laten zien</A>

source: To clear a message indicator for {serviceName}, open the application page from the Unite panel. The indicator will disappear.
nl: Open de toepassingspagina via het Unite-paneel om de berichtmelding voor {serviceName} te wissen. De indicator zal verdwijnen.

source: Each application notifies you about different events. Some applications may use several notifications; others none at all.
nl: Elke toepassing geeft meldingen voor verschillende gebeurtenissen. Sommige toepassingen gebruiken meerdere meldingen, andere geen enkele.

source: Note that notifications and activity feeds are slightly different. Most actions by you and others are added to your activity feed, which you can choose to view in the Activity Feed tab. Notifications display each time a visitor to your applications does something significant, such as downloading a large file, writing in Shoutbox, downloading a playlist or sending you a message.
nl: Merk op dat meldingen en activiteitenstromen verschillen van elkaar. De meeste activiteiten van u en anderen worden aan de activiteitenstroom toegevoegd, die u kunt bekijken via de Activiteitenstroom-tab. Meldingen verschijnen telkens als een bezoeker van uw toepassingen iets belangrijks doet, zoals het downloaden van een groot bestand, schrijven in de Shoutbox, een speellijst downloaden of u een bericht zenden.

source: The application may not be able to confirm that the change was made by you, the application owner. Reloading the page can fix this.
nl: De toepassing kan mogelijk niet bepalen dat de wijziging door u was gemaakt, als eigenaar van de toepassing. Probeer de pagina te herladen om dit op te lossen.

source: Display the Unite panel
nl: Het Unite-paneel tonen

source: Select the Reload button to confirm that the application is started.
nl: Gebruik de Herladen-knop om te controleren dat de toepassing is gestart.

source: Open the shared folder
nl: Open de gedeelde map

source: Select the shared folder
nl: Kies de gedeelde map

source: Contact {userName} and enter the password.
nl: Neem contact op met {userName} en voer het wachtwoord in.

source: Anyone may visit your {serviceName}
nl: Iedereen kan uw {serviceName} bezoeken

source: The password <EM>{password}</EM>
nl: Het wachtwoord <EM>{password}</EM>

source: Change the access type of <EM>{uid}</EM>
nl: Wijzig het soort toegang tot <EM>{uid}</EM>

source: Sorry, you need a password to access this resource.
nl: Helaas, u heeft een wachtwoord nodig voor toegang tot dit materiaal.

source: Sorry, this resource can only be accessed from the Opera Unite running this application.
nl: Helaas, dit materiaal is alleen toegankelijk vanuit het Opera Unite-paneel dat deze toepassing draait.

source: Invalid password
nl: Ongeldig wachtwoord

source: Bad or missing password
nl: Verkeerd of ontbrekend wachtwoord

source: Change method only available to the application owner
nl: Alleen de eigenaar van de toepassing kan de methode wijzigen

source: Rotate counterclockwise
nl: Linksom draaien

source: Next to the file path, select "Choose".
nl: Kies "Kiezen" naast het bestandpad.

source: Visitors to your application can easily view and access your content and do not need special software.
nl: Bezoekers van uw toepassing kunnen uw materiaal makkelijk bekijken en hebben geen speciale programma's nodig.

source: You send the password to a friend, who can use it to download your files.
nl: U stuurt het wachtwoord naar een vriend, die hiermee uw bestanden kan downloaden.

source: You send the password to a friend, who can use it to listen to your music.
nl: U stuurt het wachtwoord naar een vriend, die hiermee naar uw muziek kan luisteren.

source: You send the password to a friend, who can use it to view your Web pages.
nl: U stuurt het wachtwoord naar een vriend, die hiermee uw webpagina's kan bezoeken.

source: You send the password to a friend, who can use it to access your content.
nl: U stuurt het wachtwoord naar een vriend, die hiermee toegang heeft tot uw materiaal.

source: For your own security, do not use the same password you use for your Opera account.
nl: Ten behoeve van uw eigen veiligheid: gebruik niet hetzelfde wachtwoord als voor uw Opera-account.

source: If you do not click the message, an Opera Unite logo appears over the Opera icon in the your system tray along the bottom of your screen.
nl: Als u niet op het bericht klikt, zal een Opera Unite-logo verschijnen bovenop het Opera-pictogram in de meldingenbalk onderaan uw scherm.

source: If you do not click the message, a red number appears over the Opera icon in the Dock.
nl: Als u niet op het bericht klikt, zal een rood nummer verschijnen bovenop het Opera-pictogram in de Dock.

source: If you do not click the message, an Opera Unite logo appears over the Opera icon.
nl: Als u niet op het bericht klikt, zal een Opera Unite-logo verschijnen bovenop het Opera-pictogram.

source: The feed updates when files for this application change.
nl: De nieuwsstroom wordt bijgewerkt wanneer bestanden voor deze toepassing veranderen.

source: The feed updates when photos for this application change.
nl: De nieuwsstroom wordt bijgewerkt wanneer foto's voor deze toepassing veranderen.

source: The feed updates when music for this application changes.
nl: De nieuwsstroom wordt bijgewerkt wanneer muziek voor deze toepassing verandert.

source: The feed updates when content for {serviceName} changes.
nl: De nieuwsstroom wordt bijgewerkt wanneer materiaal voor {serviceName} verandert.

source: <A href="#">Use the Unite panel to start the application.</A>
nl: <A href="#">Gebruik het Unite-paneel om de toepassing te starten.</A>

source: {serviceName} shows a notification for these events:
nl: {serviceName} toont een melding voor deze gebeurtenissen:

source: The content of {serviceName} notifications
nl: De inhoud van {serviceName}-meldingen

source: You send the password to a friend, who can use it to see your photos.
nl: U stuurt het wachtwoord naar een vriend, die hiermee uw foto's kan bekijken.

source: Even with the "Public" setting, you can still prevent an application from appearing on your list of running applications. In the Unite panel, right-click {serviceName}, select Properties, and then Advanced settings. Select from three options that regulate the visibility of your application. <A href="{href}">Click here to learn more about your sharing options.</A>
nl: Zelfs met de instelling "Openbaar" kunt u voorkomen dat een toepassing op uw lijst van draaiende toepassingen verschijnt. Rechtsklik in het Unite-paneel op {serviceName}, kies Eigenschappen, en dan 'Geavanceerde instellingen'. Kies uit drie opties die de zichtbaarheid van uw toepassing bepalen. <A href="{href}">Klik hier om meer te weten te komen over deze opties.</A>

source: You are now listening to
nl: U luistert nu naar

source: You need <A href="http://get.adobe.com/flashplayer/">Adobe Flash Player</A> to listen to the music on this Web page.
nl: U hebt <A href="http://get.adobe.com/flashplayer/">Adobe Flash Player</A> nodig om naar de muziek op deze webpagina te luisteren.

source: Parent folder
nl: Bovenliggende map

source: No music found.
nl: Geen muziek gevonden.

source: You need to <A href="http://www.adobe.com/support/flashplayer/downloads.html">upgrade your Adobe Flash Player</A> to listen to AAC-encoded music.
nl: <A href="http://www.adobe.com/support/flashplayer/downloads.html">Upgrade de Adobe Flash Player</A> om naar muziek in AAC-formaat te luisteren.

source: Play
nl: Afspelen

source: Shuffle
nl: Willekeurige volgorde

source: Repeat
nl: Herhalen

source: <STRONG>{format}</STRONG> is an unsupported format.
nl: Het <STRONG>{format}</STRONG>-formaat wordt niet ondersteund.

source: Please provide search text with at least 3 characters.
nl: Voer ten minste drie tekens in om te zoeken.

source: Download playlist
nl: Speellijst downloaden

source: Last played
nl: Laatst gespeeld

source: Start your favorite media player with this playlist.
nl: Start uw favoriete mediaspeler met deze speellijst.

source: How to show cover art
nl: Hoe hoesplaatjes later zien

source: How to show song information
nl: Hoe informatie over nummer laten zien

source: Playing with a separate music player
nl: Afspelen met een aparte muziekspeler

source: You can download a playlist and open it later.
nl: U kunt een speellijst downloaden en deze later openen.

source: The songs in a playlist will not play unless the owner has {serviceName} running.
nl: De nummers in de speellijst zullen alleen afspelen als de eigenaar {serviceName} heeft draaien.

source: If the owner changes the Media Player password, old playlists will stop working.
nl: Als de eigenaar het wachtwoord van de Media Player wijzigt, zullen oude speellijsten stoppen met werken.

source: A song is popular with visitors
nl: Een nummer is populair bij bezoekers

source: A visitor downloads a playlist
nl: Een bezoeker download een speellijst

source: A visitor writes in the Shoutbox
nl: Een bezoeker schrijft in de Shoutbox

source: The songs that visitors listen to
nl: De nummers waarnaar bezoekers luisteren

source: Song
nl: Titel

source: Sort songs
nl: Nummers sorteren

source: Download playlist
nl: Downloaden speellijst

source: Details about {serviceName} notifications
nl: Details over {serviceName}-meldingen

source: Add cover art to your MP3 music files as an "ID3" tag.
nl: Voeg hoesplaatjes toe aan uw MP3-muziekbestanden, met een "ID3"-label.

source: See <A class="crossrefHelp" href="{href}">How to show song information</A> for more help about ID3 tags.
nl: Zie <A class="crossrefHelp" href="{href}">Hoe informatie over nummer laten zien</A> voor meer hulp met ID3-labels.

source: Add "ID3" tags to your music files, and that information will appear in the player.
nl: Als u "ID3"-labels toevoegt aan uw muziekbestanden, zal deze informatie in de speler verschijnen.

source: Some media software adds ID3 tags automatically when the files are created, for example, when importing songs from a CD.
nl: Sommige multimediaprogramma's voegen automatisch ID3-labels toe wanneer de bestanden worden gemaakt, zoals bij het rippen van een CD.

source: You can add ID3 tags to files using software designed to edit ID3 tags.
nl: U kunt ID3-labels toevoegen aan bestanden met daarvoor geschikte programma's.

source: Media Player uses only these tags: Album, Title, Album Artist, and Front cover.
nl: Media Player gebruikt alleen de volgende labels: Album, Title, Album Artist, en Front cover.

source: Clicking the playlist opens your default music player with an M3U playlist, listing the songs shown. M3U is a playlist format used by Winamp, VLC and various popular, freely available music players.
nl: Door te klikken op de speellijst zal uw standaard muziekspeler openen met een M3U-speellijst met daarin de getoonde nummers. M3U is een speellijst-formaat dat wordt gebruikt door WinAmp, VLC en diverse andere populaire gratis beschikbare muziekspelers.

source: Edit…
nl: Bewerken…

source: All your My Opera friends are offline.
nl: Al uw My Opera-vrienden zijn offline.

source: You do not seem to have added any My Opera friends.
nl: Uw hebt blijkbaar nog geen My Opera-vrienden toegevoegd.

source: Install Messenger
nl: Messenger installeren

source: {user}'s picture
nl: {user}'s foto

source: Already using Opera Unite? Use Messenger to exchange messages with {username}. <A href="http://my.opera.com/{username}/addfriend.pl">Become friends »</A>
nl: Gebruikt u Opera Unite al? Gebruik Messenger om berichten uit te wisselen met {username}. <A href="http://my.opera.com/{username}/addfriend.pl">Bevrienden »</A>

source: Send
nl: Verzend

source: You need JavaScript enabled to use this application.
nl: JavaScript moet zijn ingeschakeld voor deze toepassing.

source: You have <SPAN id="num-fans"></SPAN> friend requests »
nl: Uw hebt <SPAN id="num-fans"></SPAN> vriendschapsverzoeken »

source: Find your friends on <A href="http://my.opera.com/{username}/friends/{getArgs}" target="_blank">my.opera.com »</A>
nl: Zoek uw vrienden op <A href="http://my.opera.com/{username}/friends/{getArgs}" target="_blank">my.opera.com »</A>

source: Yesterday
nl: Gisteren

source: Loading…
nl: Laden…

source: return to <A href="http://admin.{hostName}{servicePath}">the start page of {username}'s {serviceName}</A>
nl: ga terug naar de <A href="http://admin.{hostName}{servicePath}">startpagina van {username}'s {serviceName}</A>

source: Interested in Opera Unite? Opera includes built-in applications that make it easy to share data and communicate directly with your friends. <A href="unite.opera.com">Learn more</A>
nl: Geïnteresseerd in Opera Unite? Opera heeft ingebouwde toepassingen die het makkelijk maken om gegevens te delen en direct te praten met uw vrienden. <A href="unite.opera.com">Meer te weten komen</A>

source: Show All
nl: Alles tonen

source: Older messages:
nl: Oudere berichten:

source: Open the Unite panel
nl: Open het Unite-paneel

source: No friends were imported from My Opera.
nl: Er zijn geen vrienden geïmporteerd uit My Opera.

source: Please restart Messenger from the Unite panel.
nl: Herstart Messenger via het Unite-paneel

source: Last month
nl: Afgelopen maand

source: Get online together
nl: Samen online gaan

source: Instructions for launching Messenger
nl: Instructies voor het starten van Messenger

source: Hi <SPAN id="username">{username}</SPAN>
nl: Hallo <SPAN id="username">{username}</SPAN>

source: Find friends
nl: Vrienden zoeken

source: Contact with Messenger interrupted.
nl: Verbinding met Messenger onderbroken.

source: Friends
nl: Vrienden

source: All your My Opera friends are online.
nl: All uw My Opera-vrienden zijn online.

source: Today
nl: Vandaag

source: {username} is using <A href="http://unite.opera.com/application/412/">Messenger</A> on Opera Unite.
nl: {username} gebruikt <A href="http://unite.opera.com/application/412/">Messenger</A> op Opera Unite.

source: Smilies
nl: Smileys

source: Last week
nl: Afgelopen week

source: Your My Opera friends will be listed as offline until they have Messenger running. You can send messages to friends who are offline, and they will receive them when both of you are online.
nl: Uw My Opera-vrienden worden als offline weergegeven als ze Messenger niet draaien. U kunt berichten sturen naar vrienden die offline zijn, ze zullen deze ontvangen wanneer jullie allebei online zijn.

source: <A href="http://unite.opera.com/application/412/">Tell me more about Messenger</A>.
nl: <A href="http://unite.opera.com/application/412/">Ik wil meer te weten komen over Messenger</A>.

source: Use Messenger to communicate easily with your <A href="http://my.opera.com/{username}/friends/{getArgs}" target="_blank">My Opera friends</A>.
nl: Gebruik Messenger om makkelijk te kunnen praten met uw <A href="http://my.opera.com/{username}/friends/{getArgs}" target="_blank">My Opera-vrienden</A>.

source: Get started
nl: Aan de slag

source: To use Messenger, you need to add friends on My Opera, and they must accept your friend requests. Your friends also need to have <A href="http://unite.opera.com/application/412/" target="_blank">Messenger</A> installed.
nl: Om Messenger te gebruiken moet u vrienden toevoegen op My Opera, en zij moeten uw vriendschapsverzoeken accepteren. Ook uw vrienden moeten <A href="http://unite.opera.com/application/412/" target="_blank">Messenger</A> installeren.

source: Retry…
nl: Opnieuw…

source: Collapse
nl: Inklappen

source: All
nl: Alles

source: Select <STRONG>Start</STRONG>
nl: Selecteer <STRONG>Start</STRONG>

source: You have not yet added any My Opera friends.<BR>Find your friends on <A href="http://my.opera.com/{username}/friends/{getArgs}">my.opera.com »</A>
nl: Uw hebt nog geen My Opera-vrienden toegevoegd.<BR>Zoek u vrienden op <A href="http://my.opera.com/{username}/friends/{getArgs}">my.opera.com »</A>

source: Cancel sending this message
nl: Verzenden van dit bericht annuleren

source: Please enable JavaScript to use all the features of this application.
nl: Schakel JavaScript in om alle mogelijkheden van deze toepassing te gebruiken.

source: Waiting for {user} to come online
nl: Wachten tot {user} online gaat.

source: Already using Opera? Upgrade to the latest Opera and Messenger is included.
nl: Gebruikt u Opera al? Werk bij naar de meeste recente Opera, en Messenger is inbegrepen.

source: Right-click Messenger
nl: Rechtsklik op Messenger

source: Size
nl: Grootte
