Repository: fanyer/presto
Catalog: data/translations/*/unite/*.po
Languages: nl

source: {username}'s applications
nl: {username}'s toepassingen

source: Try any of the following:
nl: Probeer de volgende oplossingen:

source: Cancel
nl: Annuleren

source: Recent activity
nl: Recente activiteit

source: This page lists applications running on {username}'s computer. Click for direct access to the content.
nl: Op deze pagina staan toepassingen die draaien op {username}'s computer. Klik erop voor directe toegang tot de inhoud.

source: Edit this text
nl: Deze tekst bewerken

source: Password:
nl: Wachtwoord:

source: Learn more
nl: Meer te weten komen

source: For your own security, please enter at least 4 letters or numbers.
nl: Gebruik minstens vier letters of cijfers voor een veilig wachtwoord.

source: Start using Opera Unite applications to share files, create instant photo galleries, listen to your music from anywhere, and much, much more. You can start these applications from the <A href="http://unite.opera.com/support/userguide/#walkthro">Unite panel</A> and <A href="http://unite.opera.com/applications">download more</A> absolutely free!
nl: Gebruik Opera Unite-toepassingen om bestanden te delen, instant-fotogalerijen te maken, overal te luisteren naar uw muziek, en veel, veel meer. U kunt deze toepassingen starten vanuit het <A href="http://unite.opera.com/support/userguide/#walkthro">Unite-paneel</A> en <A href="http://unite.opera.com/applications">er meer downloaden</A>, helemaal gratis!

source: Log in
nl: Inloggen

source: My friends' applications
nl: Toepassingen van mijn vrienden

source: Save
nl: Opslaan

source: Share via:
nl: Delen via:

source: What is Opera Unite?
nl: Wat is Opera Unite?

source: Send via e-mail
nl: Verzenden via e-mail

source: Save to Delicious
nl: Delen op Delicious

source: Opera Unite is a new way to share, connect and collaborate directly between computers across the Web.
nl: Opera Unite is een nieuwe manier van delen, verbinden en samenwerken, direct tussen computers op het web.

source: Page not found
nl: Pagina niet gevonden

source: Applications
nl: Toepassingen

source: Launch {serviceName}
nl: {serviceName} starten

source: Sharing
nl: Delen

source: Dear visitor,
nl: Beste bezoeker,

source: My applications
nl: Mijn toepassingen

source: Visit
nl: Bezoeken

source: {username} is not running any applications at the moment.
nl: {username} draait geen enkele toepassing op dit moment.

source: View all
nl: Alles zien

source: Get More Applications
nl: Meer toepassingen ophalen

source: Privacy options for {serviceName}
nl: Privacy-opties voor {serviceName}

source: Password protected
nl: Beschermd met wachtwoord

source: Account information
nl: Accountgegevens

source: It will also be uploaded and synchronized with My Opera.
nl: Zal ook worden geüpload en gesynchroniseerd met My Opera.

source: Your account
nl: Uw account

source: Profile image:
nl: Profielafbeelding:

source: Full name:
nl: Volledige naam:

source: Country:
nl: Land:

source: What activities appear here?
nl: Welke activiteiten staan hier?

source: Please use a longer name.
nl: Gebruik een langere naam.

source: Unable to connect to the Shoutbox.
nl: Kan niet verbinden met de Shoutbox.

source: There was no task to perform.
nl: Geen taken om uit te voeren.

source: Something went wrong.
nl: Er ging iets mis.

source: Message broadcasted.
nl: Bericht uitgezonden.

source: The message was blank.
nl: Het bericht was leeg.

source: Enter your name:
nl: Voer uw naam in:

source: Shared folder not found
nl: Gedeelde map niet gevonden

source: return to <A href="{servicePath}/">the start page of {username}'s {serviceName}</A>.
nl: Ga terug naar <A href="{servicePath}/">de beginpagina van {username}'s {serviceName}</A>.

source: Skip to main content
nl: Ga naar de inhoud

source: Friends' applications
nl: Toepassingen van vrienden

source: Single-click login:
nl: Een-klik-login:

source: Powered by <A href="http://unite.opera.com/">Opera Unite<IMG src="{public_html}/imgs/icon_unite_footer.png" alt=""></A>
nl: Aangedreven door <A href="http://unite.opera.com/">Opera Unite<IMG src="{public_html}/imgs/icon_unite_footer.png" alt=""></A>

source: This resource is private.
nl: Dit materiaal is privé.

source: Send {username} a message
nl: Stuur {username} een bericht

source: The password was incorrect. Try again, or <A href="http://my.opera.com/{username}/">contact {username}</A> for the password.
nl: Het wachtwoord was onjuist. Probeer het opnieuw, of neem <A href="http://my.opera.com/{username}/">contact op met {username}</A> voor het wachtwoord.

source: Cookies are required for authentication. If you have enabled them, <A href=".">please click here to reload this page and try again.</A>
nl: Cookies zijn nodig voor de waarmerking. Als u ze heeft ingeschakeld, <A href=".">klik dan hier om de pagina te herladen en het opnieuw te proberen.</A>

source: You can only visit {username}'s {serviceName} if {username} has given you the password.
nl: U kunt {username}'s {serviceName} alleen bezoeken als {username} u het wachtwoord heeft gegeven.

source: You can <A href="http://my.opera.com/{username}/about/sendmsg.dml">contact {username}</A> to ask for the password.
nl: U kunt <A href="http://my.opera.com/{username}/about/sendmsg.dml">contact opnemen met {username}</A> om te vragen naar het wachtwoord.

source: Sunday
nl: Zondag

source: Monday
nl: Maandag

source: Tuesday
nl: Dinsdag

source: Wednesday
nl: Woensdag

source: Thursday
nl: Donderdag

source: Friday
nl: Vrijdag

source: Saturday
nl: Zaterdag

source: January
nl: Januari

source: February
nl: Februari

source: March
nl: Maart

source: May
nl: Mei

source: June
nl: Juni

source: July
nl: Juli

source: August
nl: Augustus

source: October
nl: Oktober

source: tomorrow
nl: morgen

source: yesterday
nl: gisteren

source: hour
nl: uur

source: minute
nl: minuut

source: second
nl: seconde

source: right now!
nl: op dit moment!

source: year
nl: jaar

source: month
nl: maand

source: Join
nl: Doe mee

source: Share on Facebook
nl: Delen via Facebook

source: Share on Twitter
nl: Delen via Twitter

source: How sharing works
nl: Hoe werkt delen

source: How is the password used?
nl: Hoe wordt het wachtwoord gebruikt

source: What is this special link?
nl: Wat is deze speciale link?

source: How does the Shoutbox work?
nl: Hoe werkt de Shoutbox?

source: Each application publishes its own activity, and these are listed on Opera Unite Home.
nl: Elke toepassing heeft een eigen activiteitenstroom. Deze worden opgesomd op Opera Unite Home.

source: This information displays on your offline page when you are not running your computer or Opera Unite.
nl: Deze informatie wordt op uw offline-pagina getoond, wanneer uw computer of Opera Unite niet draait.

source: Enter your password to update your account information
nl: Voer uw wachtwoord in om uw accountgegevens bij te werken

source: Your {serviceName} Web address
nl: Uw {serviceName}-webadres

source: {username} has chosen to keep this application private. If you know this person, you can ask them for access.
nl: {username} heeft ervoor gekozen deze toepassing af te schermen. Als u deze persoon kent, kunt u zelf toegang vragen.

source: Go to {username}'s Opera Unite Home page
nl: Ga naar {username}'s Opera Unite Homepage

source: The owner's name is reserved.
nl: De naam van de eigenaar is gereserveerd.

source: Cliff method only available to the application owner
nl: Cliff-methode alleen beschikbaar voor de eigenaar van de toepassing

source: closeAll method only available to the application owner
nl: closeAll-methode alleen beschikbaar voor de eigenaar van de toepassing

source: All connections closed
nl: Alle verbindingen gesloten

source: Connection error; please refresh this page.
nl: Verbindingsfout; herlaad deze pagina.

source: Chat with {username} or any other visitors of {username}'s Opera Unite applications.
nl: Praat met {username} of een van de andere bezoekers van {username}'s Opera Unite-toepassingen.

source: {userServiceOrDeviceName} by {username} and Opera Unite
nl: {userServiceOrDeviceName} van {username} en Opera Unite

source: <A href="{link}">{filename}</A> was viewed in <A href="{appLink}">{appName}</A> {relativeTime}.
nl: <A href="{link}">{filename}</A> is bekeken in <A href="{appLink}">{appName}</A> {relativeTime}.

source: <A href="{link}">{filename}</A> was played by <A href="{appLink}">{appName}</A> {relativeTime}.
nl: <A href="{link}">{filename}</A> is gespeeld door de <A href="{appLink}">{appName}</A> {relativeTime}.

source: <A href="{link}">{userName}</A> posted a note on <A href="{appLink}">{appName}</A> {relativeTime}.
nl: <A href="{link}">{userName}</A> plaatste een notitie op de <A href="{appLink}">{appName}</A> {relativeTime}.

source: <A href="{link}">{userName}</A> joined <A href="{appLink}">{appName}</A> {relativeTime}.
nl: <A href="{link}">{userName}</A> doet mee in <A href="{appLink}">{appName}</A> {relativeTime}.

source: {name} has joined.
nl: {name} doet mee.

source: Sorry, but {serviceName} could not find your shared folder. Make sure you have not moved, renamed, or removed it or any of its parent folders.
nl: Helaas kan {serviceName} uw gedeelde map niet vinden. Controleer of deze, of een van de bovenliggende mappen, niet is verplaatst, hernoemd of verwijderd.

source: There seems to be something wrong with {username}'s {serviceName}. Try again later or <A href="http://my.opera.com/{username}/about/sendmsg.dml?ref=unite">notify {username}</A> about the problem.
nl: Er is iets mis met {username}'s {serviceName}. Probeer het later opnieuw, of <A href="http://my.opera.com/{username}/about/sendmsg.dml?ref=unite">vertel {username}</A> over het probleem.

source: Make sure the Web address is spelled correctly.
nl: Controleer of het webadres goed geschreven is.

source: Exit Visitor Preview
nl: Voorbeeld afsluiten

source: Preview as Visitor
nl: Zien als bezoeker

source: Invalid password. Permitted characters are a-z, A-Z and 0-9.
nl: Ongeldig wachtwoord. Toegestane tekens zijn a-z, A-Z en 0-9.

source: Save Changes
nl: Wijzigingen opslaan

source: this hour
nl: dit uur

source: this minute
nl: deze minuut

source: this second
nl: deze seconde

source: this year
nl: dit jaar

source: this month
nl: deze maand

source: this week
nl: deze week

source: in the next hour
nl: in het volgende uur

source: in the next minute
nl: in de volgende minuut

source: in the next second
nl: in de volgende seconde

source: in the next year
nl: in het volgende jaar

source: in the next month
nl: in de volgende maand

source: in the next week
nl: in de volgende week

source: in the last hour
nl: in het afgelopen uur

source: in the last minute
nl: in de afgelopen minuut

source: in the last second
nl: in de afgelopen seconde

source: in the last year
nl: in het afgelopen jaar

source: in the last month
nl: de afgelopen maand

source: in the last week
nl: de afgelopen week

source: in {number} hours
nl: over {number} uur

source: in {number} minutes
nl: over {number} minuten

source: in {number} seconds
nl: over {number} seconden

source: in {number} years
nl: over {number} jaar

source: in {number} months
nl: over {number} maanden

source: in {number} weeks
nl: over {number} weken

source: {number} hours ago
nl: {number} uur geleden

source: {number} minutes ago
nl: {number} minuten geleden

source: {number} seconds ago
nl: {number} seconden geleden

source: {number} years ago
nl: {number} jaar geleden

source: {number} months ago
nl: {number} maanden geleden

source: {number} weeks ago
nl: {number} weken geleden

source: yesterday at {thisTime}
nl: gisteren om {thisTime}

source: tomorrow at {thisTime}
nl: morgen om {thisTime}

source: next Sunday at {thisTime}
nl: aankomende zondag om {thisTime}

source: next Monday at {thisTime}
nl: aankomende maandag om {thisTime}

source: next Tuesday at {thisTime}
nl: aankomende dinsdag om {thisTime}

source: next Wednesday at {thisTime}
nl: aankomende woensdag om {thisTime}

source: next Thursday at {thisTime}
nl: aankomende donderdag om {thisTime}

source: next Friday at {thisTime}
nl: aankomende vrijdag om {thisTime}

source: next Saturday at {thisTime}
nl: aankomende zaterdag om {thisTime}

source: last Sunday at {thisTime}
nl: afgelopen zondag om {thisTime}

source: last Monday at {thisTime}
nl: afgelopen maandag om {thisTime}

source: last Tuesday at {thisTime}
nl: afgelopen dinsdag om {thisTime}

source: last Wednesday at {thisTime}
nl: afgelopen woensdag om {thisTime}

source: last Thursday at {thisTime}
nl: afgelopen donderdag om {thisTime}

source: last Friday at {thisTime}
nl: afgelopen vrijdag om {thisTime}

source: last Saturday at {thisTime}
nl: afgelopen zaterdag om {thisTime}

source: Help for the Opera Unite Home activity feed
nl: Help voor de Opera Unite Home-activiteitenstroom

source: Recent activity shows what is happening in your Opera Unite applications, for example, when a visitor views a photo album or a file upload finishes.
nl: Recente activiteit geeft aan wat er gebeurt binnen uw Opera Unite-toepassingen. Bijvoorbeeld wanneer een bezoeker een foto-album bekijkt of een bestandsoverdracht klaar is.

source: Most applications list the events that are reported to the activity feed.
nl: De meeste toepassingen geven de gebeurtenissen aan die in de activiteitenstroom worden genoemd.

source: You could choose another folder by opening <A href="http://unite.opera.com/support/userguide/#manage_panel">the Unite panel</A>, right-clicking the application and choosing "Properties".
nl: U kunt een andere map kiezen door <A href="http://unite.opera.com/support/userguide/#manage_panel">het Unite-paneel</A> het openen, te rechtsklikken op de toepassing en "Eigenschappen" te kiezen.

source: To use your own URL on the Internet instead of an IP address and port number, log in to Opera Unite.
nl: Log in bij Opera Unite om uw eigen URL op het internet te gebruiken, in plaats van een IP-adres en poortnummer.

source: This session has been banned for 30 minutes because you were too fast.
nl: Deze sessie is voor 30 minuten verbannen omdat u te snel bent.

source: Please slow down! Wait a bit.
nl: Iets langzamer graag! Even wachten.

source: 1 character left.
nl: Nog 1 teken over.

source: Your e-mail address (hidden)
nl: Uw e-mailadres (verborgen)

source: Do not allow visitors to add notes.
nl: Bezoekers geen notities laten toevoegen.

source: {charactersLeft} characters left.
nl: Nog {charactersLeft} tekens over.

source: {maxLines} lines allowed.
nl: {maxLines} regels toegestaan.

source: {name} put a note on your Fridge!
nl: {name} plaatste een notitie op uw Fridge!

source: Maximum number of notes allowed:
nl: Maximum aantal notities:

source: Add it!
nl: Toevoegen!

source: Please type a number.
nl: Voer een nummer in.

source: Empty notes are not allowed.
nl: Lege notities zijn niet toegestaan.

source: Please try again later.
nl: Probeer het later opnieuw.

source: Your name
nl: Uw naam

source: Only the Fridge owner can see your e-mail address.
nl: Alleen de eigenaar van de Fridge kan uw e-mailadres zien.

source: {name} deleted their note.
nl: {name} verwijderde zijn/haar notitie.

source: Link to your Fridge:
nl: Link naar uw Fridge:

source: Sorry! Your session is lost. Reload to start a new session?
nl: Helaas, de sessie is verloren. Herladen om een nieuwe sessie te starten?

source: Please use a shorter nickname.
nl: Gebruik een kortere bijnaam.

source: Please provide a number.
nl: Geef een nummer.

source: Please use a shorter e-mail address.
nl: Gebruik een korter e-mailadres.

source: Activity feed
nl: Activiteitenstroom

source: Your note can only be {characters} characters.
nl: Uw notitie kan maximaal {characters} tekens lang zijn.

source: Somebody
nl: Iemand

source: Type your note here…
nl: Typ hier uw notitie…

source: Visitors must know the password
nl: Bezoekers moeten het wachtwoord kennen

source: Original size
nl: Oorspronkelijke grootte

source: Click anywhere to stop the slideshow.
nl: Klik ergens op om de diashow te stoppen.

source: Previous
nl: Vorige

source: Slideshow
nl: Diashow

source: Public
nl: Openbaar

source: Next
nl: Volgende

source: Preparing…
nl: Voorbereiden…

source: Activity Feed
nl: Activiteitenstroom

source: Visitors can view and download your photos. They cannot edit, add, or delete them.
nl: Bezoekers kunnen uw foto's bekijken en downloaden. Ze kunnen deze niet bewerken, toevoegen of verwijderen.

source: It takes one second or less per thumbnail while they are being created. This only occurs the <STRONG>first time</STRONG> an album is viewed.
nl: Het aanmaken kost een seconde of minder per miniatuur. Dit gebeurt alleen tijdens de <STRONG>eerste keer</STRONG> dat een album wordt bekeken.

source: Thumbnails load very quickly after they are created.
nl: Miniaturen laden snel nadat ze zijn aangemaakt.

source: To increase the speed for first-time visitors, you can click through the pages in a new album yourself.
nl: Om de snelheid voor de eerste bezoekers te verhogen, kunt u zelf de pagina's van een nieuw album doorlopen.

source: Why are my photos not rotated?
nl: Waarom zijn mijn foto's niet gedraaid?

source: Photo Sharing will not modify your original pictures. Image rotation is saved inside an image file, in the "Exif data."
nl: Photo Sharing zal uw originele afbeeldingen niet wijzigen. Rotatie is opgeslagen binnen in een afbeeldingsbestand, in de "Exif-gegevens."

source: Some programs extract this rotation information when displaying images, but Photo Sharing does not (yet).
nl: Sommige programma's gebruiken deze informatie bij het weergeven, maar Photo Sharing doet dat (nog) niet.

source: Details regarding {serviceName} notifications
nl: Details over {serviceName}-meldingen

source: Notifications for {serviceName}
nl: Meldingen voor {serviceName}

source: A photo is popular with visitors
nl: Een foto is populair bij bezoekers

source: A visitor writes in the {serviceName} Shoutbox
nl: Een bezoeker schrijft in de Shoutbox van {serviceName}

source: Some notifications only appear when you are not viewing the {serviceName} page.
nl: Sommige meldingen verschijnen alleen wanneer u de {serviceName}-pagina niet bekijkt.

source: {serviceName} adds these items to your activity feed:
nl: {serviceName} voegt de volgende onderdelen toe aan uw activiteitenstroom:

source: The photos that visitors view
nl: De foto's die bezoekers bekijken

source: The messages that visitors write in the {serviceName} Shoutbox
nl: De berichten die bezoekers schrijven in de {serviceName}-Shoutbox

source: Photo {imageIndex} of {imagesCount}
nl: Foto {imageIndex} van {imagesCount}

source: Rotate clockwise
nl: Rechtsom draaien

source: No folder or photo found in this folder.
nl: Deze map bevat geen mappen of foto's.

source: How to use it:
nl: Hoe te gebruiken:

source: To view an album, click the album icon. To view a photo, click the thumbnail image in the overview.
nl: Klik op het albumpictogram om een album te bekijken. Klik op een miniatuur in het overzicht om een foto te bekijken.

source: Click the photo to view the next one. Click "Zoom" to view the photo in its original, full size format.
nl: Klik op een foto om de volgende te zien. Klik op "Zoom" om een foto in zijn originele afmetingen te bekijken.

source: Click "Download" below the photo to save the original photo on your own computer.
nl: Klik op "Downloaden" onder een foto om de originele foto op uw computer op te slaan.

source: The password
nl: Het wachtwoord

source: Only for friends with the password.
nl: Alleen voor vrienden met het wachtwoord.

source: Open for everyone.
nl: Toegankelijk voor iedereen.

source: Only you can access these files.
nl: Alleen u hebt toegang tot deze bestanden.

source: Only for you.
nl: Alleen voor u.

source: Open the folder with your shared content.
nl: De map met gedeeld materiaal openen.

source: Select the folder with your shared content.
nl: Kies de map met uw gedeelde materiaal.

source: How to edit your files
nl: Hoe kunt u bestanden bewerken?

source: To edit, copy or delete these files, you must open this folder on your computer.
nl: Om deze bestanden te bewerken, te kopiëren of te verwijderen, moet u deze map openen op uw computer.

source: Follow these steps:
nl: Volg deze stappen:

source: Open the properties dialog for {serviceName}.
nl: Open het eigenschappenvenster voor {serviceName}.

source: Changing the shared folder
nl: De gedeelde map wijzigen?

source: {serviceName} shares files from a folder you choose on your computer.
nl: {serviceName} deelt bestanden vanuit een map op uw computer die u heeft gekozen.

source: Use a <STRONG>password</STRONG> to protect your {serviceName}, and only give it to friends.
nl: Gebruik een <STRONG>wachtwoord</STRONG> om uw {serviceName} af te schermen, en alleen aan vrienden te tonen.

source: If your computer is not on, a visitor will see the text "{username}'s computer is offline".
nl: Als uw computer niet aan staat, zal de bezoeker de tekst "{username}'s computer is offline" zien.

source: You can change the password to anything you like.
nl: U kunt naar wens het wachtwoord veranderen.

source: Select "Public" to allow <STRONG>anyone</STRONG> to visit your {serviceName} application, without a password.
nl: Kies "Openbaar" om <STRONG>iedereen</STRONG> toegang te geven tot uw {serviceName}-toepassing, zonder een wachtwoord.

source: How do notifications work?
nl: Hoe werken meldingen?

source: Right-click {serviceName}
nl: Rechtsklik op {serviceName}

source: Select "Start"
nl: Kies "Starten"

source: Page not fully loaded
nl: Pagina niet volledig geladen

source: The page may not have finished loading.
nl: Mogelijk is deze pagina nog niet volledig geladen.

source: Why does this help?
nl: Waarom helpt dit?

source: Application not running
nl: Toepassing draait niet

source: Make sure the application is started.
nl: Zorg dat de toepassing draait.

source: The {serviceName} page may still be open even though the application has stopped.
nl: De {serviceName}-pagina kan geopend zijn, ook als de toepasssing is gestopt.

source: To edit, copy or delete these files, click "Edit."
nl: Klik op "Bewerken" om deze bestanden te bewerken, te kopiëren of te verwijderen.

source: This is an example of a notification.
nl: Dit is een voorbeeld van een melding.

source: Edit, copy or delete files
nl: Bestanden bewerken, kopiëren of verwijderen

source: Select a different folder for {serviceName}
nl: Kies een andere map voor {serviceName}

source: Subscribe to visitor activity in {serviceName}
nl: Abonneer op bezoekersactiviteit in {serviceName}

source: How long does it take to load thumbnails?
nl: Hoe lang duurt het om miniaturen te laden?

source: Edit...
nl: Bewerken...

source: {serviceName} begins sharing content from the new folder.
nl: {serviceName} begint materiaal delen vanuit de nieuwe map.

source: Alert
nl: Waarschuwing

source: The folder opens in Windows Explorer. Now you can make changes.
nl: De map zal worden geopend in Windows Verkenner. Hier kunt u wijzigingen maken.

source: The folder opens in Finder. Now you can make changes.
nl: De map zal worden geopend in de Finder. Hier kunt u wijzigingen maken.

source: The folder opens in your file manager. Now you can make changes.
nl: De map zal worden geopend in uw bestandsbeheerder. Hier kunt u wijzigingen maken.

source: Select the new folder using the Browse For Folder window.
nl: Kies de nieuwe map met het 'Blader naar map'-venster.

source: Select the new folder using Finder.
nl: Kies de nieuwe map met de Finder.

source: Select the new folder using your file manager folder selector.
nl: Kies de nieuwe map met de mapkiezer van uw bestandsbeheerder.
