Repository: fanyer/presto
Catalog: data/translations/*/unite/*.po
Languages: nl

source: {counter} files
nl: {counter} bestanden

source: 1 folder
nl: 1 map

source: and
nl: en

source: {counter} folders
nl: {counter} mappen

source: 1 file
nl: 1 bestand

source: Name
nl: Naam

source: View
nl: Bekijk

source: Modified Date
nl: Laatst gewijzigd

source: A file is popular with visitors
nl: Een bestand is populair bij bezoekers

source: A large file is being downloaded
nl: Een groot bestand wordt gedownload

source: The files that visitors view or download
nl: De bestanden die bezoekers bekijken of downloaden

source: The messages that visitors write in the Shoutbox
nl: De berichten die bezoekers in de Shoutbox schrijven

source: File {fileName} was viewed
nl: Bestand {fileName} is bekeken

source: This folder is empty.
nl: Deze map is leeg.

source: This sample Web page <STRONG>index.html</STRONG> was created when you clicked "generate a sample file" in a folder without an index.html file. Edit it to suit your taste. This is the first page visitors to your Web Server will see.
nl: Deze <STRONG>index.html</STRONG> voorbeeld-webpagina werd aangemaakt toen u klikte op "genereer een voorbeeldbestand" in een map zonder een bestand "index.html". Pas het aan uw eigen behoeften aan. Dit is de eerste pagina die bezoekers van uw webserver zullen zien.

source: Resources
nl: Hulpmiddelen

source: <EM>This folder contains an index.html file.</EM> This is the first page visitors to your Web Server will see: <A href="{index}">{index}</A>
nl: <EM>Deze map bevat een bestand "index.html".</EM> Dat is de eerste pagina die bezoekers aan uw webserver zullen zien: <A href="{index}">{index}</A>

source: To learn more about Web development and design, see the
nl: Om meer te weten te komen over ontwikkelen en ontwerpen voor het web, zie de

source: Visitors will see the files in this folder, as there is no index.html file to display.
nl: Bezoekers krijgen alle bestanden in deze map te zien, aangezien er geen bestand "index.html" is om te tonen.

source: If you want visitors to see an index page, create an index.html file or <A href="?create_index=true">generate a sample file</A>.
nl: Als u wilt dat bezoekers een indexpagina te zien krijgen, maak dan een bestand "index.html" of <A href="?create_index=true">genereer een voorbeeldbestand</A>.

source: A page is popular with visitors
nl: Een pagina is populair bij bezoekers

source: The pages that visitors view
nl: Pagina's die door bezoekers worden bekeken

source: About the index.html file
nl: Over het bestand index.html

source: How does the "index.html" file work?
nl: Hoe werkt het bestand "index.html"?

source: The index.html file is shown to a visitor <STRONG>instead of</STRONG> the contents of a folder.
nl: Bezoekers krijgen het bestand index.html te zien <STRONG>in plaats van</STRONG> de inhoudsopgave van een map.

source: To hide the contents of a folder from visitors, use an index.html containing a blank page.
nl: Gebruik een index.html met een lege pagina om de inhoud van een map te verbergen voor bezoekers.

source: Each folder and sub-folder must have its own index.html file.
nl: Elke map en submap heeft een eigen bestand index.html nodig.
