Repository: fanyer/presto
Catalog: data/translations/*/unite/messenger.po
Languages: es_es

source: {user}'s picture
es_es: Foto de {user}

source: Waiting for {user} to come online
es_es: Esperando que {user} esté en línea

source: Cancel sending this message
es_es: Cancelar el envío de este mensaje

source: Collapse
es_es: Plegar

source: Contact with Messenger interrupted.
es_es: Se ha interrumpido el contacto con Messenger

source: Please restart Messenger from the Unite panel.
es_es: Reinicia Messenger desde el panel de Unite, por favor.

source: Open the Unite panel
es_es: Abrir el panel de Unite

source: Right click Messenger
es_es: Clic con el derecho en Messenger

source: Select <strong>Start</strong>
es_es: Elegir <strong>inicio</strong>

source: Get started
es_es: Comenzar

source: Loading…
es_es: Cargando…

source: Help
es_es: Ayuda

source: Older messages:
es_es: Mensajes anteriores:

source: Today
es_es: Hoy

source: Yesterday
es_es: Ayer

source: Last week
es_es: Semana pasada

source: Last month
es_es: Mes pasado

source: All
es_es: Todos

source: Use Messenger to communicate easily with your <A href="http://my.opera.com/{username}/friends/" target="_blank">My Opera friends</A>.
es_es: Usa Messenger para comunicarte fácilmente con tus <A href="http://my.opera.com/{username}/friends/" target="_blank">amigos de My Opera</A>.

source: Find friends
es_es: Buscar amigos

source: Install Messenger
es_es: Instalar Messenger

source: To use Messenger, you need to add friends on My Opera, and they must accept your friend requests. Your friends also need to have <A href="http://unite.opera.com/application/412/" target="_blank">Messenger</A> installed.
es_es: Para usar Messenger necesitas añadir amigos en My Opera, y ellos deben aceptar tu solicitud. Tus amigos también deben tener instalado <A href="http://unite.opera.com/application/412/" target="_blank">Messenger</A>.

source: Get online together
es_es: Juntos en línea

source: Your My Opera friends will be listed as offline until they have Messenger running. You can send messages to friends who are offline, and they will receive them when both of you are online.
es_es: Tus amigos de My Opera aparecerán fuera de línea hasta que incien Messenger. Puedes enviar mensajes a amigos que no están en línea y los recibirán cuando ambos estéis conectados.

source: You need JavaScript enabled to use this application.
es_es: Necesitas que JavaScript está activado para usar esta aplicación.

source: Smilies
es_es: Emoricones

source: Send
es_es: Enviar

source: Friends
es_es: Amigos

source: You have 1 friend request »
es_es: Tienes 1 petición de amigos »

source: You have {count} friend requests »
es_es: Tienes {count} peticiones de amigos »

source: Find your friends on <A href="http://my.opera.com/{username}/friends/" target="_blank">my.opera.com »</A>
es_es: Busca a tus amigos en <A href="http://my.opera.com/{username}/friends/" target="_blank">my.opera.com »</A>

source: Online
es_es: En línea

source: All your My Opera friends are offline.
es_es: Todos tus amigos de My Opera están fuera de línea.

source: Offline
es_es: Fuera de línea

source: All your My Opera friends are online.
es_es: Todos mis amigos de Opera están en línea.

source: You have not yet added any My Opera friends.<BR>Find your friends on <A href="http://my.opera.com/{username}/friends/">my.opera.com »</A>
es_es: Todavía no has añadido ningún amigo de My Opera.<BR>Busca a tus amigos en <A href="http://my.opera.com/{username}/friends/">my.opera.com »</A>

source: Hi <SPAN id="username">{username}</SPAN>
es_es: ¡Hola <SPAN id="username">{username}</SPAN>!

source: Retry…
es_es: Reintentar…

source: You do not seem to have added any My Opera friends.
es_es: No parece que hayas añadido ningún amigo de My Opera.

source: Invite your friends to join My Opera by <A href="http://my.opera.com/{username}/friends/invite/" target="_blank">sending them e-mail</A>.
es_es: Invita a tus amigos a unirse a My Opera <A href="http://my.opera.com/{username}/friends/invite/" target="_blank">enviándoles un correo</A>.

source: No friends were imported from My Opera.
es_es: No has importado ningún amigo de My Opera.

source: Show All
es_es: Ver todos

source: {username} is using <A href="http://unite.opera.com/application/412/">Messenger</A> on Opera Unite.
es_es: {username} usa <A href="http://unite.opera.com/application/412/">Messenger</A> en Opera Unite.

source: Interested in Opera Unite? Opera includes built-in applications that make it easy to share data and communicate directly with your friends. <A href="unite.opera.com">Learn more</A>
es_es: ¿Te interesa Opera Unite? Opera incluye aplicaciones que hacen fácil el compartir datos y comunicarse directamente con tus amigos. <A href="unite.opera.com">¿Quieres saber más?</A>

source: Already using Opera? Upgrade to Opera 10.10 and Messenger is included.
es_es: ¿Ya usas Opera? Actualízate a Opera 10.10 y verás que Messenger está incluido.

source: Instructions for launching Messenger
es_es: Instrucciones para iniciar Messenger

source: Already using Opera Unite? Use Messenger to exchange messages with {username}. <A href="http://my.opera.com/{username}/addfriend.pl">Become friends »</A>
es_es: ¿Ya usas Opera Unite? Usa Messenger para intercambiar mensajes con {username}. <A href="http://my.opera.com/{username}/addfriend.pl">Ser amigos »</A>

source: <A href="http://unite.opera.com/application/412/">Tell me more about Messenger</A>.
es_es: <A href="http://unite.opera.com/application/412/">Cuéntame más sobre Messenger</A>.

source: You have 1 new message
es_es: Tienes 1 mensaje nuevo

source: You have {count} new messages
es_es: Tienes {count} mensajes nuevos

source: You have no new messages
es_es: No tienes ningún mensaje nuevo

source: Powered by <A href="http://unite.opera.com/">Opera Unite</A>
es_es: Propulsado por <A href="http://unite.opera.com/">Opera Unite</A>
